-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Сен 02 2025 г., 02:36
-- Версия сервера: 10.4.32-MariaDB
-- Версия PHP: 8.0.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `student_bot`
--

-- --------------------------------------------------------

--
-- Структура таблицы `events`
--

CREATE TABLE `events` (
  `id` int(11) NOT NULL,
  `title` varchar(100) NOT NULL,
  `description` text DEFAULT NULL,
  `event_date` datetime NOT NULL,
  `created_by` int(11) DEFAULT NULL,
  `attendance_code` varchar(4) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `event_attendance`
--

CREATE TABLE `event_attendance` (
  `id` int(11) NOT NULL,
  `event_id` int(11) DEFAULT NULL,
  `user_id` int(11) DEFAULT NULL,
  `status` enum('registered','attended') DEFAULT 'registered'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `sks_applications`
--

CREATE TABLE `sks_applications` (
  `id` int(11) NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `photo_url` varchar(200) DEFAULT NULL,
  `status` enum('pending','approved','rejected') DEFAULT 'pending',
  `applied_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `tutors`
--

CREATE TABLE `tutors` (
  `id` int(11) NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `code` varchar(6) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `tutors`
--

INSERT INTO `tutors` (`id`, `user_id`, `code`) VALUES
(1, 1, '485236'),
(2, 2, '729154'),
(3, 3, '361842'),
(4, 4, '594718'),
(5, 5, '827365'),
(6, 6, '153927'),
(7, 7, '486219'),
(8, 8, '735482'),
(9, 9, '962574'),
(10, 10, '284637'),
(11, 11, '517394'),
(12, 12, '649281'),
(13, 13, '372819'),
(14, 14, '895723'),
(15, 15, '128456');

-- --------------------------------------------------------

--
-- Структура таблицы `tutor_groups`
--

CREATE TABLE `tutor_groups` (
  `tutor_id` int(11) DEFAULT NULL,
  `group_name` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `tutor_groups`
--

INSERT INTO `tutor_groups` (`tutor_id`, `group_name`) VALUES
(13, '222232');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `full_name` varchar(100) NOT NULL,
  `student_id` varchar(20) DEFAULT NULL,
  `telegram_id` bigint(20) DEFAULT NULL,
  `telegram_username` varchar(50) DEFAULT NULL,
  `phone_number` varchar(20) DEFAULT NULL,
  `role` enum('student','tutor','admin') DEFAULT 'student',
  `group_name` varchar(50) DEFAULT NULL,
  `tutor_id` int(11) DEFAULT NULL,
  `points` int(11) DEFAULT 0,
  `is_prof_union` tinyint(1) DEFAULT 0,
  `is_sks` tinyint(1) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `full_name`, `student_id`, `telegram_id`, `telegram_username`, `phone_number`, `role`, `group_name`, `tutor_id`, `points`, `is_prof_union`, `is_sks`) VALUES
(1, 'Агафонов Кузьма Аркадьевич', NULL, NULL, NULL, NULL, 'admin', NULL, NULL, 0, 0, 0),
(2, 'Плотникова Татьяна Сергеевна', NULL, NULL, NULL, NULL, 'admin', NULL, NULL, 0, 0, 0),
(3, 'Трусов Григорий Александрович', NULL, NULL, NULL, NULL, 'tutor', NULL, NULL, 0, 0, 0),
(4, 'Борискин Даниил Александрович', NULL, NULL, NULL, NULL, 'tutor', NULL, NULL, 0, 0, 0),
(5, 'Осетрова Алина Романовна', NULL, NULL, NULL, NULL, 'tutor', NULL, NULL, 0, 0, 0),
(6, 'Молостова Карина Денисовна', NULL, NULL, NULL, NULL, 'tutor', NULL, NULL, 0, 0, 0),
(7, 'Якунина Ксения Алексеевна', NULL, NULL, NULL, NULL, 'tutor', NULL, NULL, 0, 0, 0),
(8, 'Ягудин Иван Васильевич', NULL, NULL, NULL, NULL, 'tutor', NULL, NULL, 0, 0, 0),
(9, 'Калинченко Андрей Андреевич', NULL, NULL, NULL, NULL, 'tutor', NULL, NULL, 0, 0, 0),
(10, 'Юрченко Екатерина Валентиновна', NULL, NULL, NULL, NULL, 'tutor', NULL, NULL, 0, 0, 0),
(11, 'Ратахина Анна Алексеевна', NULL, NULL, NULL, NULL, 'tutor', NULL, NULL, 0, 0, 0),
(12, 'Геворгян Давид Андраникович', NULL, NULL, NULL, NULL, 'tutor', NULL, NULL, 0, 0, 0),
(13, 'Манжосов Владислав Константинович', NULL, 793258161, 'focusnik_off', NULL, 'tutor', NULL, NULL, 0, 0, 0),
(14, 'Наумова Елизавета Алексеевна', NULL, NULL, NULL, NULL, 'admin', NULL, NULL, 0, 0, 0),
(15, 'Матасов Василий Федорович', NULL, NULL, NULL, NULL, 'admin', NULL, NULL, 0, 0, 0),
(16, 'Тестовый Аккаунт', '230766', 7842026007, 'axoramanager', '+79330315288', 'student', '222232', 13, 0, 0, 0),
(54, 'Буравкин Глеб Александрович', '368475', NULL, NULL, NULL, 'student', '220251', NULL, 0, 0, 0),
(55, 'Гольнев Владислав Юрьевич', '884267', NULL, NULL, NULL, 'student', '220251', NULL, 0, 0, 0),
(56, 'Гопоненко Артём Алексеевич', '924541', NULL, NULL, NULL, 'student', '220251', NULL, 0, 0, 0),
(57, 'Грехов Кирилл Эдуардович', '976527', NULL, NULL, NULL, 'student', '220251', NULL, 0, 0, 0),
(58, 'Громов Антон Андреевич', '241346', NULL, NULL, NULL, 'student', '220251', NULL, 0, 0, 0),
(59, 'Гусейнов Даниэль Султанович', '432527', NULL, NULL, NULL, 'student', '220251', NULL, 0, 0, 0),
(60, 'Джун Роман Дмитриевич', '911274', NULL, NULL, NULL, 'student', '220251', NULL, 0, 0, 0),
(61, 'Илюхина София Дмитриевна', '144535', NULL, NULL, NULL, 'student', '220251', NULL, 0, 0, 0),
(62, 'Колесников Прохор Евгеньевич', '777338', NULL, NULL, NULL, 'student', '220251', NULL, 0, 0, 0),
(63, 'Кузнецова Дарья Дмитриевна', '854158', NULL, NULL, NULL, 'student', '220251', NULL, 0, 0, 0),
(64, 'Курманалиев Руслан Нурланович', '184634', NULL, NULL, NULL, 'student', '220251', NULL, 0, 0, 0),
(65, 'Луков Борис Александрович', '692994', NULL, NULL, NULL, 'student', '220251', NULL, 0, 0, 0),
(66, 'Лысых Артём Владимирович', '838914', NULL, NULL, NULL, 'student', '220251', NULL, 0, 0, 0),
(67, 'Никулин Артём Эрнестович', '464559', NULL, NULL, NULL, 'student', '220251', NULL, 0, 0, 0),
(68, 'Носов Николай Андреевич', '688155', NULL, NULL, NULL, 'student', '220251', NULL, 0, 0, 0),
(69, 'Рамондодов Шамиль Хомидович', '248262', NULL, NULL, NULL, 'student', '220251', NULL, 0, 0, 0),
(70, 'Семенов Владислав Юрьевич', '735427', NULL, NULL, NULL, 'student', '220251', NULL, 0, 0, 0),
(71, 'Скоропад Никита Вадимович', '888761', NULL, NULL, NULL, 'student', '220251', NULL, 0, 0, 0),
(72, 'Суханова Анастасия Евгеньевна', '394995', NULL, NULL, NULL, 'student', '220251', NULL, 0, 0, 0),
(73, 'Телевная Анна Дмитриевна', '633995', NULL, NULL, NULL, 'student', '220251', NULL, 0, 0, 0),
(74, 'Токмачёв Евгений Дмитриевич', '864262', NULL, NULL, NULL, 'student', '220251', NULL, 0, 0, 0),
(75, 'Усов Максим Вадимович', '467816', NULL, NULL, NULL, 'student', '220251', NULL, 0, 0, 0),
(76, 'Филипенко Филипп Сергеевич', '195956', NULL, NULL, NULL, 'student', '220251', NULL, 0, 0, 0),
(77, 'Филиппов Дмитрий Николаевич', '449523', NULL, NULL, NULL, 'student', '220251', NULL, 0, 0, 0),
(78, 'Чудинова Елизавета Дмитриевна', '126435', NULL, NULL, NULL, 'student', '220251', NULL, 0, 0, 0),
(79, 'Юрчик Виктория Юрьевна', '368417', NULL, NULL, NULL, 'student', '220251', NULL, 0, 0, 0),
(80, 'Яковенко Богдан Сергеевич', '627187', NULL, NULL, NULL, 'student', '220251', NULL, 0, 0, 0),
(81, 'Бошкин Михаил Денисович', '724832', NULL, NULL, NULL, 'student', '220053-02', NULL, 0, 0, 0),
(82, 'Воронцов Александр Владимирович', '436488', NULL, NULL, NULL, 'student', '220053-02', NULL, 0, 0, 0),
(83, 'Ковряков Вячеслав Ильич', '546458', NULL, NULL, NULL, 'student', '220053-02', NULL, 0, 0, 0),
(84, 'Погосов Григорий Антонович', '443831', NULL, NULL, NULL, 'student', '220053-02', NULL, 0, 0, 0),
(85, 'Полянский Егор Сергеевич', '213446', NULL, NULL, NULL, 'student', '220053-02', NULL, 0, 0, 0),
(86, 'Баннов Роман Александрович', '547188', NULL, NULL, NULL, 'student', '220252', NULL, 0, 0, 0),
(87, 'Бочаров Дмитрий Алексеевич', '124487', NULL, NULL, NULL, 'student', '220252', NULL, 0, 0, 0),
(88, 'Власов Евгений Евгеньевич', '151949', NULL, NULL, NULL, 'student', '220252', NULL, 0, 0, 0),
(89, 'Войнов Станислав Иванович', '243641', NULL, NULL, NULL, 'student', '220252', NULL, 0, 0, 0),
(90, 'Войтенко Игорь Игоревич', '839639', NULL, NULL, NULL, 'student', '220252', NULL, 0, 0, 0),
(91, 'Давыдова Александра Александровна', '679769', NULL, NULL, NULL, 'student', '220252', NULL, 0, 0, 0),
(92, 'Дмитренко Данил Дмитриевич', '935852', NULL, NULL, NULL, 'student', '220252', NULL, 0, 0, 0),
(93, 'Ермаков Денис Иванович', '924934', NULL, NULL, NULL, 'student', '220252', NULL, 0, 0, 0),
(94, 'Жданов Даниил Сергеевич', '319933', NULL, NULL, NULL, 'student', '220252', NULL, 0, 0, 0),
(95, 'Зацепин Николай Евгеньевич', '423863', NULL, NULL, NULL, 'student', '220252', NULL, 0, 0, 0),
(96, 'Казимирова Ольга Павловна', '415643', NULL, NULL, NULL, 'student', '220252', NULL, 0, 0, 0),
(97, 'Кочетыгов Андрей Максимович', '965446', NULL, NULL, NULL, 'student', '220252', NULL, 0, 0, 0),
(98, 'Красножон Александр Андреевич', '892247', NULL, NULL, NULL, 'student', '220252', NULL, 0, 0, 0),
(99, 'Курятков Егор Сергеевич', '646549', NULL, NULL, NULL, 'student', '220252', NULL, 0, 0, 0),
(100, 'Логачев Никита Андреевич', '993327', NULL, NULL, NULL, 'student', '220252', NULL, 0, 0, 0),
(101, 'Муминов Муслим Музаффарович', '342261', NULL, NULL, NULL, 'student', '220252', NULL, 0, 0, 0),
(102, 'Мягков Даниил Евгеньевич', '558313', NULL, NULL, NULL, 'student', '220252', NULL, 0, 0, 0),
(103, 'Савенков Максим Сергеевич', '747377', NULL, NULL, NULL, 'student', '220252', NULL, 0, 0, 0),
(104, 'Сазончик Георгий Андреевич', '673397', NULL, NULL, NULL, 'student', '220252', NULL, 0, 0, 0),
(105, 'Сальков Владислав Андреевич', '293823', NULL, NULL, NULL, 'student', '220252', NULL, 0, 0, 0),
(106, 'Сергеев Иван Сергеевич', '741455', NULL, NULL, NULL, 'student', '220252', NULL, 0, 0, 0),
(107, 'Сладких Кирилл Сергеевич', '784991', NULL, NULL, NULL, 'student', '220252', NULL, 0, 0, 0),
(108, 'Соломатин Владислав Александрович', '348495', NULL, NULL, NULL, 'student', '220252', NULL, 0, 0, 0),
(109, 'Стюков Глеб Александрович', '342471', NULL, NULL, NULL, 'student', '220252', NULL, 0, 0, 0),
(110, 'Таланова Ксения Андреевна', '742842', NULL, NULL, NULL, 'student', '220252', NULL, 0, 0, 0),
(111, 'Ткачёв Артём Дмитриевич', '835847', NULL, NULL, NULL, 'student', '220252', NULL, 0, 0, 0),
(112, 'Чернышов Никита Максимович', '827124', NULL, NULL, NULL, 'student', '220252', NULL, 0, 0, 0),
(113, 'Афонов Иван Николаевич', '466627', NULL, NULL, NULL, 'student', '220451', NULL, 0, 0, 0),
(114, 'Воеводин Егор Олегович', '212199', NULL, NULL, NULL, 'student', '220451', NULL, 0, 0, 0),
(115, 'Дергачёв Владислав Максиевич', '833899', NULL, NULL, NULL, 'student', '220451', NULL, 0, 0, 0),
(116, 'Дерюгин Денис Игоревич', '839294', NULL, NULL, NULL, 'student', '220451', NULL, 0, 0, 0),
(117, 'Ефимова Ульяна Дмитриевна', '559946', NULL, NULL, NULL, 'student', '220451', NULL, 0, 0, 0),
(118, 'Зайцева Ева Андреевна', '493135', NULL, NULL, NULL, 'student', '220451', NULL, 0, 0, 0),
(119, 'Иванова Анастасия Игоревна', '647669', NULL, NULL, NULL, 'student', '220451', NULL, 0, 0, 0),
(120, 'Климов Денис Константинович', '338526', NULL, NULL, NULL, 'student', '220451', NULL, 0, 0, 0),
(121, 'Краснухин Станислав Владимирович', '966218', NULL, NULL, NULL, 'student', '220451', NULL, 0, 0, 0),
(122, 'Кураенков Ярослав Сергеевич', '996624', NULL, NULL, NULL, 'student', '220451', NULL, 0, 0, 0),
(123, 'Матвеев Егор Александрович', '293541', NULL, NULL, NULL, 'student', '220451', NULL, 0, 0, 0),
(124, 'Набиев Руслан Турсуналиевич', '448668', NULL, NULL, NULL, 'student', '220451', NULL, 0, 0, 0),
(125, 'Новикова Анастасия Дмитриевна', '243585', NULL, NULL, NULL, 'student', '220451', NULL, 0, 0, 0),
(126, 'Полтораков Максим Анатолььевич', '841284', NULL, NULL, NULL, 'student', '220451', NULL, 0, 0, 0),
(127, 'Рудова Полина Александровна', '918913', NULL, NULL, NULL, 'student', '220451', NULL, 0, 0, 0),
(128, 'Самиков Дмитрий Русланович', '689535', NULL, NULL, NULL, 'student', '220451', NULL, 0, 0, 0),
(129, 'Селимов Селим Ягибекович', '732748', NULL, NULL, NULL, 'student', '220451', NULL, 0, 0, 0),
(130, 'Соколов Максим Андреевич', '636879', NULL, NULL, NULL, 'student', '220451', NULL, 0, 0, 0),
(131, 'Соколов Эмиль Эльдарович', '953349', NULL, NULL, NULL, 'student', '220451', NULL, 0, 0, 0),
(132, 'Тадевосян Ишхан Артаваздович', '388452', NULL, NULL, NULL, 'student', '220451', NULL, 0, 0, 0),
(133, 'Тимонин Артём Андреевич', '245692', NULL, NULL, NULL, 'student', '220451', NULL, 0, 0, 0),
(134, 'Толмачева Юлия Сергеевна', '727817', NULL, NULL, NULL, 'student', '220451', NULL, 0, 0, 0),
(135, 'Чеканов Данил Денисович', '818268', NULL, NULL, NULL, 'student', '220451', NULL, 0, 0, 0),
(136, 'Червяков Виктор Андреевич', '726111', NULL, NULL, NULL, 'student', '220451', NULL, 0, 0, 0),
(137, 'Чирьев Егор Сергеевич', '585857', NULL, NULL, NULL, 'student', '220451', NULL, 0, 0, 0),
(138, 'Якимов Николай Иванович', '213273', NULL, NULL, NULL, 'student', '220451', NULL, 0, 0, 0),
(139, 'Егорова Мария Алексеевна', '263888', NULL, NULL, NULL, 'student', '220051-04', NULL, 0, 0, 0),
(140, 'Зубова Анна Дмитриевна', '675832', NULL, NULL, NULL, 'student', '220051-04', NULL, 0, 0, 0),
(141, 'Колесников Иван Сергеевич', '616279', NULL, NULL, NULL, 'student', '220051-04', NULL, 0, 0, 0),
(142, 'Марахов Илья Владимирович', '621967', NULL, NULL, NULL, 'student', '220051-04', NULL, 0, 0, 0),
(143, 'Петров Дмитрий Александрович', '562642', NULL, NULL, NULL, 'student', '220051-04', NULL, 0, 0, 0),
(144, 'Рожок Даниил Алексеевич', '719796', NULL, NULL, NULL, 'student', '220051-04', NULL, 0, 0, 0),
(145, 'Фомин Александр Леонидович', '811518', NULL, NULL, NULL, 'student', '220051-04', NULL, 0, 0, 0),
(146, 'Аксенов Никита Михайлович', '922713', NULL, NULL, NULL, 'student', '220551', NULL, 0, 0, 0),
(147, 'Антипов Георгий Анатольевич', '371319', NULL, NULL, NULL, 'student', '220551', NULL, 0, 0, 0),
(148, 'Богатырёв Роман Владимирович', '446711', NULL, NULL, NULL, 'student', '220551', NULL, 0, 0, 0),
(149, 'Быковский Михаил Кириллович', '288332', NULL, NULL, NULL, 'student', '220551', NULL, 0, 0, 0),
(150, 'Ведешкин Андрей Юрьевич', '925143', NULL, NULL, NULL, 'student', '220551', NULL, 0, 0, 0),
(151, 'Виноградов Ярослав Игоревич', '515654', NULL, NULL, NULL, 'student', '220551', NULL, 0, 0, 0),
(152, 'Кондауров Алексей Александрович', '757141', NULL, NULL, NULL, 'student', '220551', NULL, 0, 0, 0),
(153, 'Кудинов Алексей Алексеевич', '453247', NULL, NULL, NULL, 'student', '220551', NULL, 0, 0, 0),
(154, 'Кудряшов Илья Денисович', '776599', NULL, NULL, NULL, 'student', '220551', NULL, 0, 0, 0),
(155, 'Мнацаканян Арман Суренович', '539724', NULL, NULL, NULL, 'student', '220551', NULL, 0, 0, 0),
(156, 'Нищев Александр Алексеевич', '498412', NULL, NULL, NULL, 'student', '220551', NULL, 0, 0, 0),
(157, 'Сидоров Дмитрий Андреевич', '247734', NULL, NULL, NULL, 'student', '220551', NULL, 0, 0, 0),
(158, 'Ткачев Даниил Романович', '647149', NULL, NULL, NULL, 'student', '220551', NULL, 0, 0, 0),
(159, 'Ефимова Светлана Александровна', '979392', NULL, NULL, NULL, 'student', '220051-05', NULL, 0, 0, 0),
(160, 'Загребова София Викторовна', '552489', NULL, NULL, NULL, 'student', '220051-05', NULL, 0, 0, 0),
(161, 'Карпухина Мария Юрьевна', '158215', NULL, NULL, NULL, 'student', '220051-05', NULL, 0, 0, 0),
(162, 'Киселева Анжелика Сергеевна', '829748', NULL, NULL, NULL, 'student', '220051-05', NULL, 0, 0, 0),
(163, 'Левченко Андрей Александрович', '726944', NULL, NULL, NULL, 'student', '220051-05', NULL, 0, 0, 0),
(164, 'Орлова Татьяна Алексеевна', '958362', NULL, NULL, NULL, 'student', '220051-05', NULL, 0, 0, 0),
(165, 'Титов Денис Евгеньевич', '596942', NULL, NULL, NULL, 'student', '220051-05', NULL, 0, 0, 0),
(166, 'Токарев Кирилл Денисович', '253728', NULL, NULL, NULL, 'student', '220051-05', NULL, 0, 0, 0),
(167, 'Абаляев Данила Михайлович', '592654', NULL, NULL, NULL, 'student', '220651', NULL, 0, 0, 0),
(168, 'Абрамов Роман Дмитриевич', '817355', NULL, NULL, NULL, 'student', '220651', NULL, 0, 0, 0),
(169, 'Асадчий Никита Алексеевич', '984121', NULL, NULL, NULL, 'student', '220651', NULL, 0, 0, 0),
(170, 'Бойкова Полина Станиславовна', '689538', NULL, NULL, NULL, 'student', '220651', NULL, 0, 0, 0),
(171, 'Боловин Артём Сергеевич', '285568', NULL, NULL, NULL, 'student', '220651', NULL, 0, 0, 0),
(172, 'Гетманский Дмитрий Александрович', '314463', NULL, NULL, NULL, 'student', '220651', NULL, 0, 0, 0),
(173, 'Гречишкин Егор Алексеевич', '455983', NULL, NULL, NULL, 'student', '220651', NULL, 0, 0, 0),
(174, 'Губарев Егор Сергеевич', '833167', NULL, NULL, NULL, 'student', '220651', NULL, 0, 0, 0),
(175, 'Иванов Матвей Николаевич', '777812', NULL, NULL, NULL, 'student', '220651', NULL, 0, 0, 0),
(176, 'Измайлов Иван Евгеньевич', '971998', NULL, NULL, NULL, 'student', '220651', NULL, 0, 0, 0),
(177, 'Ким Ярослав Борисович', '827226', NULL, NULL, NULL, 'student', '220651', NULL, 0, 0, 0),
(178, 'Красников Андрей Алексеевич', '449286', NULL, NULL, NULL, 'student', '220651', NULL, 0, 0, 0),
(179, 'Мишин Алексей Александрович', '372664', NULL, NULL, NULL, 'student', '220651', NULL, 0, 0, 0),
(180, 'Неаронский Борис Викторович', '336675', NULL, NULL, NULL, 'student', '220651', NULL, 0, 0, 0),
(181, 'Подчуфаров Василий Игоревич', '276948', NULL, NULL, NULL, 'student', '220651', NULL, 0, 0, 0),
(182, 'Рожков Артём Сергеевич', '479522', NULL, NULL, NULL, 'student', '220651', NULL, 0, 0, 0),
(183, 'Скачков Андрей Игоревич', '818555', NULL, NULL, NULL, 'student', '220651', NULL, 0, 0, 0),
(184, 'Старостин Иван Алексеевич', '313479', NULL, NULL, NULL, 'student', '220651', NULL, 0, 0, 0),
(185, 'Сычева Анастасия Александровна', '664939', NULL, NULL, NULL, 'student', '220651', NULL, 0, 0, 0),
(186, 'Терехова Екатерина Артёмовна', '355945', NULL, NULL, NULL, 'student', '220651', NULL, 0, 0, 0),
(187, 'Трошин Фёдор Романович', '297363', NULL, NULL, NULL, 'student', '220651', NULL, 0, 0, 0),
(188, 'Черкалин Артём Сергеевич', '879452', NULL, NULL, NULL, 'student', '220651', NULL, 0, 0, 0),
(189, 'Черников Вадим Алексеевич', '345342', NULL, NULL, NULL, 'student', '220651', NULL, 0, 0, 0),
(190, 'Чижков Кирилл Сергеевич', '268189', NULL, NULL, NULL, 'student', '220651', NULL, 0, 0, 0),
(191, 'Юдин Владислав Владимирович', '224644', NULL, NULL, NULL, 'student', '220651', NULL, 0, 0, 0),
(192, 'Волков Иван Алексеевич', '435754', NULL, NULL, NULL, 'student', '220053-06', NULL, 0, 0, 0),
(193, 'Плахотников Арсений Алексеевич', '963285', NULL, NULL, NULL, 'student', '220053-06', NULL, 0, 0, 0),
(194, 'Серегин Иван Дмитриевич', '628781', NULL, NULL, NULL, 'student', '220053-06', NULL, 0, 0, 0),
(195, 'Филатов Илья Сергеевич', '642771', NULL, NULL, NULL, 'student', '220053-06', NULL, 0, 0, 0),
(196, 'Чигирин Герман Михайлович', '415493', NULL, NULL, NULL, 'student', '220053-06', NULL, 0, 0, 0),
(197, 'Чумаков Сергей Александрович', '487632', NULL, NULL, NULL, 'student', '220053-06', NULL, 0, 0, 0),
(198, 'Щукин Михаил Сергеевич', '625124', NULL, NULL, NULL, 'student', '220053-06', NULL, 0, 0, 0),
(199, 'Шамарина Диана Вадимовна', '162999', NULL, NULL, NULL, 'student', '220053-06', NULL, 0, 0, 0),
(200, 'Васин Вячеслав Денисович', '242624', NULL, NULL, NULL, 'student', '220652', NULL, 0, 0, 0),
(201, 'Ватыкин Вячеслав Геннадьевич', '847388', NULL, NULL, NULL, 'student', '220652', NULL, 0, 0, 0),
(202, 'Вишняков Тимофей Ярославович', '951185', NULL, NULL, NULL, 'student', '220652', NULL, 0, 0, 0),
(203, 'Голощапов Андрей Владимирович', '963534', NULL, NULL, NULL, 'student', '220652', NULL, 0, 0, 0),
(204, 'Голуб Добрыня Михайлович', '658935', NULL, NULL, NULL, 'student', '220652', NULL, 0, 0, 0),
(205, 'Деревянкин Архип Евгеньевич', '652658', NULL, NULL, NULL, 'student', '220652', NULL, 0, 0, 0),
(206, 'Иванов Даниил Денисович', '497525', NULL, NULL, NULL, 'student', '220652', NULL, 0, 0, 0),
(207, 'Коленкова Елизавета Петровна', '436233', NULL, NULL, NULL, 'student', '220652', NULL, 0, 0, 0),
(208, 'Коровин Николай Александрович', '477473', NULL, NULL, NULL, 'student', '220652', NULL, 0, 0, 0),
(209, 'Лысикова Ульяна Станиславовна', '119258', NULL, NULL, NULL, 'student', '220652', NULL, 0, 0, 0),
(210, 'Мединский Игорь Сергеевич', '437913', NULL, NULL, NULL, 'student', '220652', NULL, 0, 0, 0),
(211, 'Меркулов Дмитрий Валерьевич', '556728', NULL, NULL, NULL, 'student', '220652', NULL, 0, 0, 0),
(212, 'Поляков Андрей Павлович', '529725', NULL, NULL, NULL, 'student', '220652', NULL, 0, 0, 0),
(213, 'Рязанцев Кирилл Максимович', '515789', NULL, NULL, NULL, 'student', '220652', NULL, 0, 0, 0),
(214, 'Саламандык Антон Сергеевич', '441144', NULL, NULL, NULL, 'student', '220652', NULL, 0, 0, 0),
(215, 'Смирнов Арсений Евгеньевич', '761336', NULL, NULL, NULL, 'student', '220652', NULL, 0, 0, 0),
(216, 'Сударев Алексей Юрьевич', '385548', NULL, NULL, NULL, 'student', '220652', NULL, 0, 0, 0),
(217, 'Тимохин Дмитрий Викторович', '121828', NULL, NULL, NULL, 'student', '220652', NULL, 0, 0, 0),
(218, 'Титов Михаил Владимирович', '351712', NULL, NULL, NULL, 'student', '220652', NULL, 0, 0, 0),
(219, 'Усас Сергей Алексеевич', '323952', NULL, NULL, NULL, 'student', '220652', NULL, 0, 0, 0),
(220, 'Филиппов Егор Максимович', '725582', NULL, NULL, NULL, 'student', '220652', NULL, 0, 0, 0),
(221, 'Цой Альберт Вадимович', '472153', NULL, NULL, NULL, 'student', '220652', NULL, 0, 0, 0),
(222, 'Четвергов Артём Романович', '718854', NULL, NULL, NULL, 'student', '220652', NULL, 0, 0, 0),
(223, 'Шакиров Арсений Романович', '843979', NULL, NULL, NULL, 'student', '220652', NULL, 0, 0, 0),
(224, 'Якжин Артём Павлович', '427524', NULL, NULL, NULL, 'student', '220652', NULL, 0, 0, 0),
(225, 'Акишин Михаил Андреевич', '345733', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(226, 'Артамонов Никита Сергеевич', '994495', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(227, 'Беляева Ксения Алексеевна', '982327', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(228, 'Биличенко Станислав Олегович', '736527', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(229, 'Вздорнова Екатерина Владимировна', '476672', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(230, 'Волков Артемий Валерьевич', '863293', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(231, 'Горбачев Кирилл Николаевич', '297276', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(232, 'Горбунов Юрий Андреевич', '197688', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(233, 'Гребенюк Руслан Максимович', '173124', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(234, 'Гридин Егор Сергеевич', '391788', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(235, 'Загидуллин Тимур Рустамович', '255341', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(236, 'Золотарев Дмитрий Игоревич', '338668', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(237, 'Индюков Дмитирий Дмитриевич', '922792', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(238, 'Кудинова Дарья Олеговна', '337266', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(239, 'Кузнецов Дмитрий Михайлович', '872927', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(240, 'Кулаков Павел Aлексеевич', '917982', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(241, 'Лапшин Никита Дмитриевич', '372874', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(242, 'Макаров Кирилл Викторович', '111611', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(243, 'Мишнёв Валерий Валерьевич', '262442', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(244, 'Морозов Евгений Михайлович', '149479', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(245, 'Пучкова Элеонора Игоревна', '341474', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(246, 'Рыженков Никита Дмитриевич', '117335', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(247, 'Ряузова Алина Николаевна', '993626', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(248, 'Савин Максим Александрович', '686451', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(249, 'Семёнов Максим Валерьевич', '644311', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(250, 'Сергеева Елизавета Андреевна', '666824', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(251, 'Силкин Кирилл Иванович', '393382', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(252, 'Соломатин Александр Анатольевич', '772792', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(253, 'Спесивцева Маргарита Олеговна', '776815', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(254, 'Степанов Артём Сергеевич', '473659', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(255, 'Сулейманов Станислав Романович', '136725', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(256, 'Ухваткина Мария Евгеньевна', '191118', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(257, 'Хромов Иван Александрович', '269794', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(258, 'Чирков Арсений Дмитриевич', '852968', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(259, 'Шульженко Кристина Сергеевна', '638422', NULL, NULL, NULL, 'student', '221151', NULL, 0, 0, 0),
(260, 'Ахмадов Абузар Рауф Оглы', '575262', NULL, NULL, NULL, 'student', '220052-11', NULL, 0, 0, 0),
(261, 'Ващекин Арсений Константинович', '136574', NULL, NULL, NULL, 'student', '220052-11', NULL, 0, 0, 0),
(262, 'Верховцев Иван Вадимович', '483641', NULL, NULL, NULL, 'student', '220052-11', NULL, 0, 0, 0),
(263, 'Горелова Софья Валерьевна', '979291', NULL, NULL, NULL, 'student', '220052-11', NULL, 0, 0, 0),
(264, 'Донская Екатерина Дмитриевна', '216859', NULL, NULL, NULL, 'student', '220052-11', NULL, 0, 0, 0),
(265, 'Ершов Арсений Владимирович', '851262', NULL, NULL, NULL, 'student', '220052-11', NULL, 0, 0, 0),
(266, 'Журина Александра Ивановна', '583252', NULL, NULL, NULL, 'student', '220052-11', NULL, 0, 0, 0),
(267, 'Завьялов Егор Алексеевич', '961184', NULL, NULL, NULL, 'student', '220052-11', NULL, 0, 0, 0),
(268, 'Зыбайло Илья Александрович', '872316', NULL, NULL, NULL, 'student', '220052-11', NULL, 0, 0, 0),
(269, 'Караваев Роман Андреевич', '945771', NULL, NULL, NULL, 'student', '220052-11', NULL, 0, 0, 0),
(270, 'Клименко Анастасия Юрьевна', '381625', NULL, NULL, NULL, 'student', '220052-11', NULL, 0, 0, 0),
(271, 'Кочеткова Анастасия Дмитриевна', '888395', NULL, NULL, NULL, 'student', '220052-11', NULL, 0, 0, 0),
(272, 'Самохов Дмитрий Сергеевич', '281429', NULL, NULL, NULL, 'student', '220052-11', NULL, 0, 0, 0),
(273, 'Семенов Андрей Андреевич', '427257', NULL, NULL, NULL, 'student', '220052-11', NULL, 0, 0, 0),
(274, 'Слепцова Елизавета Сергеевна', '765924', NULL, NULL, NULL, 'student', '220052-11', NULL, 0, 0, 0),
(275, 'Соколовский Сергей Романович', '421666', NULL, NULL, NULL, 'student', '220052-11', NULL, 0, 0, 0),
(276, 'Стародумов Дмитрий Александрович', '298574', NULL, NULL, NULL, 'student', '220052-11', NULL, 0, 0, 0),
(277, 'Старцев Артём Александрович', '951591', NULL, NULL, NULL, 'student', '220052-11', NULL, 0, 0, 0),
(278, 'Филин Даниил Артаваздович', '953423', NULL, NULL, NULL, 'student', '220052-11', NULL, 0, 0, 0),
(279, 'Храмцов Михаил Юрьевич', '662593', NULL, NULL, NULL, 'student', '220052-11', NULL, 0, 0, 0),
(280, 'Чадаева Полина Андреевна', '552935', NULL, NULL, NULL, 'student', '220052-11', NULL, 0, 0, 0),
(281, 'Шмелев Александр Александрович', '863476', NULL, NULL, NULL, 'student', '220052-11', NULL, 0, 0, 0),
(282, 'Бородин Всеволод Александрович', '695627', NULL, NULL, NULL, 'student', '221351', NULL, 0, 0, 0),
(283, 'Бурдун Дария Игоревна', '692265', NULL, NULL, NULL, 'student', '221351', NULL, 0, 0, 0),
(284, 'Вепринцев Михаил Антонович', '954169', NULL, NULL, NULL, 'student', '221351', NULL, 0, 0, 0),
(285, 'Гончаров Иннокентий Дмитриевич', '819438', NULL, NULL, NULL, 'student', '221351', NULL, 0, 0, 0),
(286, 'Ермилова Дарья Сергеевна', '656527', NULL, NULL, NULL, 'student', '221351', NULL, 0, 0, 0),
(287, 'Козлов Максим Романович', '496536', NULL, NULL, NULL, 'student', '221351', NULL, 0, 0, 0),
(288, 'Коломейцев Александр Артемович', '497862', NULL, NULL, NULL, 'student', '221351', NULL, 0, 0, 0),
(289, 'Круглов Максим Андреевич', '274456', NULL, NULL, NULL, 'student', '221351', NULL, 0, 0, 0),
(290, 'Кузнецов Артём Дмитриевич', '813754', NULL, NULL, NULL, 'student', '221351', NULL, 0, 0, 0),
(291, 'Куклюгова Наталья Александровна', '774626', NULL, NULL, NULL, 'student', '221351', NULL, 0, 0, 0),
(292, 'Марченко Ярослав Иванович', '152275', NULL, NULL, NULL, 'student', '221351', NULL, 0, 0, 0),
(293, 'Павлюк Софья Эдуардовна', '463948', NULL, NULL, NULL, 'student', '221351', NULL, 0, 0, 0),
(294, 'Паустовский Тимофей Сергеевич', '139869', NULL, NULL, NULL, 'student', '221351', NULL, 0, 0, 0),
(295, 'Pискарев Никита Андреевич', '529462', NULL, NULL, NULL, 'student', '221351', NULL, 0, 0, 0),
(296, 'Серов Илья Алексеевич', '131946', NULL, NULL, NULL, 'student', '221351', NULL, 0, 0, 0),
(297, 'Старостин Артемий Романович', '775372', NULL, NULL, NULL, 'student', '221351', NULL, 0, 0, 0),
(298, 'Страхов Михаил Дмитриевич', '692142', NULL, NULL, NULL, 'student', '221351', NULL, 0, 0, 0),
(299, 'Фролов Антон Александрович', '169948', NULL, NULL, NULL, 'student', '221351', NULL, 0, 0, 0),
(300, 'Юматова Амиралия Алексеевна', '996379', NULL, NULL, NULL, 'student', '221351', NULL, 0, 0, 0),
(301, 'Гуров Андрей Александрович', '458586', NULL, NULL, NULL, 'student', '220052-13', NULL, 0, 0, 0),
(302, 'Денисов Павел Анатольевич', '149355', NULL, NULL, NULL, 'student', '220052-13', NULL, 0, 0, 0),
(303, 'Жданова Эмилия Эдуардовна', '124443', NULL, NULL, NULL, 'student', '220052-13', NULL, 0, 0, 0),
(304, 'Клычев Эмир Максатович', '471631', NULL, NULL, NULL, 'student', '220052-13', NULL, 0, 0, 0),
(305, 'Комерилов Григорий Андреевич', '523643', NULL, NULL, NULL, 'student', '220052-13', NULL, 0, 0, 0),
(306, 'Селютина Елизавета Григорьевна', '378339', NULL, NULL, NULL, 'student', '220052-13', NULL, 0, 0, 0),
(307, 'Дружинин Илья Сергеевич', '591664', NULL, NULL, NULL, 'student', '221451', NULL, 0, 0, 0),
(308, 'Звонков Егор Владимирович', '148817', NULL, NULL, NULL, 'student', '221451', NULL, 0, 0, 0),
(309, 'Ивашов Евгений Дмитриевич', '819487', NULL, NULL, NULL, 'student', '221451', NULL, 0, 0, 0),
(310, 'Казарьян Гектор Александрович', '825497', NULL, NULL, NULL, 'student', '221451', NULL, 0, 0, 0),
(311, 'Клещев Денис Владимирович', '281477', NULL, NULL, NULL, 'student', '221451', NULL, 0, 0, 0),
(312, 'Климанов Артём Антонович', '775997', NULL, NULL, NULL, 'student', '221451', NULL, 0, 0, 0),
(313, 'Клюкин Максим Андреевич', '269548', NULL, NULL, NULL, 'student', '221451', NULL, 0, 0, 0),
(314, 'Лашевская Анастасия Валерьевна', '854475', NULL, NULL, NULL, 'student', '221451', NULL, 0, 0, 0),
(315, 'Максимов Максим Сергеевич', '172512', NULL, NULL, NULL, 'student', '221451', NULL, 0, 0, 0),
(316, 'Масленников Алексей Дмитриевич', '215393', NULL, NULL, NULL, 'student', '221451', NULL, 0, 0, 0),
(317, 'Миронов Артём Александрович', '372798', NULL, NULL, NULL, 'student', '221451', NULL, 0, 0, 0),
(318, 'Пономарёв Дмитрий Алексеевич', '468858', NULL, NULL, NULL, 'student', '221451', NULL, 0, 0, 0),
(319, 'Сапожникова Ангелина Николаевна', '494745', NULL, NULL, NULL, 'student', '221451', NULL, 0, 0, 0),
(320, 'Сорокин Святослав Николаевич', '327228', NULL, NULL, NULL, 'student', '221451', NULL, 0, 0, 0),
(321, 'Старцев Никита Алексеевич', '447576', NULL, NULL, NULL, 'student', '221451', NULL, 0, 0, 0),
(322, 'Хумарян Гурген Левонович', '231135', NULL, NULL, NULL, 'student', '221451', NULL, 0, 0, 0),
(323, 'Шилин Андрей Олегович', '771361', NULL, NULL, NULL, 'student', '221451', NULL, 0, 0, 0),
(324, 'Арефьева Анна Сергеевна', '227361', NULL, NULL, NULL, 'student', '220051-14', NULL, 0, 0, 0),
(325, 'Горчаков Денис Валерьевич', '561242', NULL, NULL, NULL, 'student', '220051-14', NULL, 0, 0, 0),
(326, 'Долинина Алёна Михайловна', '929378', NULL, NULL, NULL, 'student', '220051-14', NULL, 0, 0, 0),
(327, 'Дулов Валерий Сергеевич', '166342', NULL, NULL, NULL, 'student', '220051-14', NULL, 0, 0, 0),
(328, 'Евланова Ирина Александровна', '897715', NULL, NULL, NULL, 'student', '220051-14', NULL, 0, 0, 0),
(329, 'Жуков Глеб Андреевич', '367285', NULL, NULL, NULL, 'student', '220051-14', NULL, 0, 0, 0),
(330, 'Ким Иван Сергеевич', '531568', NULL, NULL, NULL, 'student', '220051-14', NULL, 0, 0, 0),
(331, 'Ковалев Тимофей Дмитриевич', '867514', NULL, NULL, NULL, 'student', '220051-14', NULL, 0, 0, 0),
(332, 'Курилов Михаил Григорьевич', '281563', NULL, NULL, NULL, 'student', '220051-14', NULL, 0, 0, 0),
(333, 'Лагунин Егор Алексеевич', '453819', NULL, NULL, NULL, 'student', '220051-14', NULL, 0, 0, 0),
(334, 'Мазовецкий Иван Евгеньевич', '298386', NULL, NULL, NULL, 'student', '220051-14', NULL, 0, 0, 0),
(335, 'Осадчий Артём Викторович', '328939', NULL, NULL, NULL, 'student', '220051-14', NULL, 0, 0, 0),
(336, 'Савельев Никита Владимирович', '872283', NULL, NULL, NULL, 'student', '220051-14', NULL, 0, 0, 0),
(337, 'Саркисов Максим Ионович', '329251', NULL, NULL, NULL, 'student', '220051-14', NULL, 0, 0, 0),
(338, 'Ситникова Дарья Дмитриевна', '928156', NULL, NULL, NULL, 'student', '220051-14', NULL, 0, 0, 0),
(339, 'Титов Тимофей Владимирович', '335138', NULL, NULL, NULL, 'student', '220051-14', NULL, 0, 0, 0),
(340, 'Акорчин Илья Владимирович', '834531', NULL, NULL, NULL, 'student', '222251', NULL, 0, 0, 0),
(341, 'Антипов Александр Дмитриевич', '263615', NULL, NULL, NULL, 'student', '222251', NULL, 0, 0, 0),
(342, 'Бедарев Константин Сергеевич', '787654', NULL, NULL, NULL, 'student', '222251', NULL, 0, 0, 0),
(343, 'Гомон Марина Дмитриевна', '239169', NULL, NULL, NULL, 'student', '222251', NULL, 0, 0, 0),
(344, 'Евстигнеева Татьяна Aлексеевна', '351966', NULL, NULL, NULL, 'student', '222251', NULL, 0, 0, 0),
(345, 'Катышев Кирилл Максимович', '861556', NULL, NULL, NULL, 'student', '222251', NULL, 0, 0, 0),
(346, 'Кацеро Николай Александрович', '326584', NULL, NULL, NULL, 'student', '222251', NULL, 0, 0, 0),
(347, 'Козленко Анна Сергеевна', '592837', NULL, NULL, NULL, 'student', '222251', NULL, 0, 0, 0),
(348, 'Корнеев Григорий Романович', '259116', NULL, NULL, NULL, 'student', '222251', NULL, 0, 0, 0),
(349, 'Королев Георгий Геннадьевич', '451318', NULL, NULL, NULL, 'student', '222251', NULL, 0, 0, 0),
(350, 'Мазяр Игорь Владимирович', '376584', NULL, NULL, NULL, 'student', '222251', NULL, 0, 0, 0),
(351, 'Молчанов Никита Андреевич', '311919', NULL, NULL, NULL, 'student', '222251', NULL, 0, 0, 0),
(352, 'Мусатов Александр Александрович', '718776', NULL, NULL, NULL, 'student', '222251', NULL, 0, 0, 0),
(353, 'Петрусевич Иван Александрович', '539389', NULL, NULL, NULL, 'student', '222251', NULL, 0, 0, 0),
(354, 'Подольский Дмитрий Владимирович', '136375', NULL, NULL, NULL, 'student', '222251', NULL, 0, 0, 0),
(355, 'Рассадкин Даниил Дмитриевич', '423978', NULL, NULL, NULL, 'student', '222251', NULL, 0, 0, 0),
(356, 'Ратников Даниил Андреевич', '631679', NULL, NULL, NULL, 'student', '222251', NULL, 0, 0, 0),
(357, 'Тутуко Мария Сергеевна', '967981', NULL, NULL, NULL, 'student', '222251', NULL, 0, 0, 0),
(358, 'Черемушкин Евгений Aлексеевич', '598571', NULL, NULL, NULL, 'student', '222251', NULL, 0, 0, 0),
(359, 'Чуканов Сергей Витальевич', '118729', NULL, NULL, NULL, 'student', '222251', NULL, 0, 0, 0),
(360, 'Шевченко Анна Александровна', '434746', NULL, NULL, NULL, 'student', '222251', NULL, 0, 0, 0),
(361, 'Агапов Антон Сергеевич', '240623', NULL, NULL, NULL, 'student', '222251', NULL, 0, 0, 0),
(362, 'Школьников Данила Евгеньевич', '240686', NULL, NULL, NULL, 'student', '222251', NULL, 0, 0, 0),
(363, 'Говоров Никита Витальевич', '838485', NULL, NULL, NULL, 'student', '220053-22', NULL, 0, 0, 0),
(364, 'Дворецких Кирилл Сергеевич', '644157', NULL, NULL, NULL, 'student', '220053-22', NULL, 0, 0, 0),
(365, 'Мамай Константин Павлович', '614346', NULL, NULL, NULL, 'student', '220053-22', NULL, 0, 0, 0),
(366, 'Медведев Денис Максимович', '154566', NULL, NULL, NULL, 'student', '220053-22', NULL, 0, 0, 0),
(367, 'Полунин Александр Евгеньевич', '193344', NULL, NULL, NULL, 'student', '220053-22', NULL, 0, 0, 0),
(368, 'Аршинкин Дмитрий Александрович', '176392', NULL, NULL, NULL, 'student', '222252', NULL, 0, 0, 0),
(369, 'Барсамян Элен Араиковна', '371364', NULL, NULL, NULL, 'student', '222252', NULL, 0, 0, 0),
(370, 'Бурденков Игорь Олегович', '163655', NULL, NULL, NULL, 'student', '222252', NULL, 0, 0, 0),
(371, 'Быков Кирилл Константинович', '636895', NULL, NULL, NULL, 'student', '222252', NULL, 0, 0, 0),
(372, 'Вирченко Виктория Альбертовна', '532815', NULL, NULL, NULL, 'student', '222252', NULL, 0, 0, 0),
(373, 'Земляной Егор Витальевич', '792547', NULL, NULL, NULL, 'student', '222252', NULL, 0, 0, 0),
(374, 'Изох Никита Сергеевич', '815451', NULL, NULL, NULL, 'student', '222252', NULL, 0, 0, 0),
(375, 'Казанцев Максим Aлексеевич', '828685', NULL, NULL, NULL, 'student', '222252', NULL, 0, 0, 0),
(376, 'Коржова Валерия Дмитриевна', '735437', NULL, NULL, NULL, 'student', '222252', NULL, 0, 0, 0),
(377, 'Курнаков Тимур Денисович', '964793', NULL, NULL, NULL, 'student', '222252', NULL, 0, 0, 0),
(378, 'Лялин Максим Дмитриевич', '316916', NULL, NULL, NULL, 'student', '222252', NULL, 0, 0, 0),
(379, 'Макаров Дмитрий Игоревич', '672114', NULL, NULL, NULL, 'student', '222252', NULL, 0, 0, 0),
(380, 'Маринин Антон Aлексеевич', '457193', NULL, NULL, NULL, 'student', '222252', NULL, 0, 0, 0),
(381, 'Миненков Владислав Ростиславович', '467165', NULL, NULL, NULL, 'student', '222252', NULL, 0, 0, 0),
(382, 'Огнев Владислав Павлович', '166265', NULL, NULL, NULL, 'student', '222252', NULL, 0, 0, 0),
(383, 'Околелов Никита Сергеевич', '633193', NULL, NULL, NULL, 'student', '222252', NULL, 0, 0, 0),
(384, 'Плясов Андрей Владимирович', '781865', NULL, NULL, NULL, 'student', '222252', NULL, 0, 0, 0),
(385, 'Поволоцкий Данила Сергеевич', '989335', NULL, NULL, NULL, 'student', '222252', NULL, 0, 0, 0),
(386, 'Румянцев Алексей Павлович', '634185', NULL, NULL, NULL, 'student', '222252', NULL, 0, 0, 0),
(387, 'Телышев Даниил Константинович', '778513', NULL, NULL, NULL, 'student', '222252', NULL, 0, 0, 0),
(388, 'Хасаия Георгий Эльдарович', '597168', NULL, NULL, NULL, 'student', '222252', NULL, 0, 0, 0),
(389, 'Чувикин Максим Витальевич', '315654', NULL, NULL, NULL, 'student', '222252', NULL, 0, 0, 0),
(390, 'Щепетильников Никита Андреевич', '637782', NULL, NULL, NULL, 'student', '222252', NULL, 0, 0, 0),
(391, 'Агуреев Иван Евгеньевич', '558196', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(392, 'Ампилов Даниил Петрович', '474881', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(393, 'Бархатов Даниил Константинович', '294645', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(394, 'Башков Максим Дмитриевич', '114818', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(395, 'Богданов Антон Сергеевич', '528139', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(396, 'Борисов Александр Дмитриевич', '983533', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(397, 'Бурцева Ангелина Сергеевна', '613165', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(398, 'Воронин Иван Игоревич', '342541', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(399, 'Газин Леонид Андреевич', '497236', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(400, 'Денисов Эмиль Дмитриевич', '699731', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(401, 'Dунаев Никита Вадимович', '192283', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(402, 'Жданов Александр Юрьевич', '888422', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(403, 'Карлов Арсений Сергеевич', '421836', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(404, 'Комаровская Мария Анатольевна', '676594', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(405, 'Коростелёв Дмитрий Олегович', '123319', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(406, 'Кузнецов Антон Александрович', '429296', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(407, 'Лактюхин Максим Николаевич', '891748', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(408, 'Лапин Егор Александрович', '226892', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(409, 'Левашин Рустам Иванович', '276259', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(410, 'Левин Никита Александрович', '695892', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(411, 'Миронова София Олеговна', '254672', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(412, 'Панкратов Даниил Сергеевич', '922937', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(413, 'Подмарев Кирилл Станиславович', '337277', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(414, 'Пуц Дмитрий Сергеевич', '227973', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(415, 'Раджабов Ратмир Русланович', '484866', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(416, 'Сербина Софья Александровна', '179358', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(417, 'Середина Алисия Александровна', '666548', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(418, 'Фролов Артём Игоревич', '778738', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(419, 'Чернышев Сергей Сергеевич', '469232', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(420, 'Шадрин Дмитрий Александрович', '327935', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(421, 'Шипуль Дмитрий Владиславович', '183313', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(422, 'Шорохов Сергей Александрович', '942525', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(423, 'Штуль Егор Антонович', '966846', NULL, NULL, NULL, 'student', '230751', NULL, 0, 0, 0),
(424, 'Васильев Александр Иванович', '322792', NULL, NULL, NULL, 'student', '230053-07', NULL, 0, 0, 0),
(425, 'Поздняк Андрей Сергеевич', '733426', NULL, NULL, NULL, 'student', '230053-07', NULL, 0, 0, 0),
(426, 'Попов Павел Сергеевич', '662297', NULL, NULL, NULL, 'student', '230053-07', NULL, 0, 0, 0),
(427, 'Ферапонтов Роман Александрович', '315384', NULL, NULL, NULL, 'student', '230053-07', NULL, 0, 0, 0);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `events`
--
ALTER TABLE `events`
  ADD PRIMARY KEY (`id`),
  ADD KEY `created_by` (`created_by`);

--
-- Индексы таблицы `event_attendance`
--
ALTER TABLE `event_attendance`
  ADD PRIMARY KEY (`id`),
  ADD KEY `event_id` (`event_id`),
  ADD KEY `user_id` (`user_id`);

--
-- Индексы таблицы `sks_applications`
--
ALTER TABLE `sks_applications`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Индексы таблицы `tutors`
--
ALTER TABLE `tutors`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `code` (`code`),
  ADD UNIQUE KEY `user_id` (`user_id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `student_id` (`student_id`),
  ADD UNIQUE KEY `telegram_id` (`telegram_id`),
  ADD KEY `tutor_id` (`tutor_id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `events`
--
ALTER TABLE `events`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT для таблицы `event_attendance`
--
ALTER TABLE `event_attendance`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `sks_applications`
--
ALTER TABLE `sks_applications`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `tutors`
--
ALTER TABLE `tutors`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=31;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=428;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `events`
--
ALTER TABLE `events`
  ADD CONSTRAINT `events_ibfk_1` FOREIGN KEY (`created_by`) REFERENCES `users` (`id`);

--
-- Ограничения внешнего ключа таблицы `event_attendance`
--
ALTER TABLE `event_attendance`
  ADD CONSTRAINT `event_attendance_ibfk_1` FOREIGN KEY (`event_id`) REFERENCES `events` (`id`),
  ADD CONSTRAINT `event_attendance_ibfk_2` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`);

--
-- Ограничения внешнего ключа таблицы `sks_applications`
--
ALTER TABLE `sks_applications`
  ADD CONSTRAINT `sks_applications_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`);

--
-- Ограничения внешнего ключа таблицы `tutors`
--
ALTER TABLE `tutors`
  ADD CONSTRAINT `tutors_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`);

--
-- Ограничения внешнего ключа таблицы `users`
--
ALTER TABLE `users`
  ADD CONSTRAINT `users_ibfk_1` FOREIGN KEY (`tutor_id`) REFERENCES `users` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
